<%@ Page Title="" Language="C#" MasterPageFile="~/MasterPage/Step.Master" AutoEventWireup="true" CodeBehind="Step1.aspx.cs"
Inherits="CustomerHealthCheck.viewx.NDID.Step1" %>

<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="server">
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" runat="server">

    <div class="page-content footer-clear">
        <div class="pt-3">
            <div class="page-title d-flex">
                <div class="align-self-center">
                    <a href="#" onclick="redirectToMain()" class="me-3 ms-0 icon icon-xxs bg-theme rounded-s shadow-m">
                        <i class="bi bi-chevron-left color-theme font-14"></i>
                    </a>
                </div>
                <div class="align-self-center me-auto">
                    <h1 class="color-theme mb-0 font-18">ย้อนกลับ</h1>
                </div>

            </div>
        </div>

        <svg id="header-deco" viewBox="0 0 1440 600" xmlns="http://www.w3.org/2000/svg" class="transition duration-300 ease-in-out delay-150">
            <path id="header-deco-1" d="M 0,600 C 0,600 0,120 0,120 C 92.36363636363635,133.79904306220095 184.7272727272727,147.59808612440193 287,148 C 389.2727272727273,148.40191387559807 501.4545454545455,135.40669856459328 592,129 C 682.5454545454545,122.5933014354067 751.4545454545455,122.77511961722489 848,115 C 944.5454545454545,107.22488038277511 1068.7272727272727,91.49282296650718 1172,91 C 1275.2727272727273,90.50717703349282 1357.6363636363635,105.25358851674642 1440,120 C 1440,120 1440,600 1440,600 Z"></path>
            <path id="header-deco-2" d="M 0,600 C 0,600 0,240 0,240 C 98.97607655502392,258.2105263157895 197.95215311004785,276.4210526315789 278,282 C 358.04784688995215,287.5789473684211 419.16746411483257,280.5263157894737 524,265 C 628.8325358851674,249.4736842105263 777.377990430622,225.47368421052633 888,211 C 998.622009569378,196.52631578947367 1071.3205741626793,191.57894736842107 1157,198 C 1242.6794258373207,204.42105263157893 1341.3397129186603,222.21052631578948 1440,240 C 1440,240 1440,600 1440,600 Z"></path>
            <path id="header-deco-3" d="M 0,600 C 0,600 0,360 0,360 C 65.43540669856458,339.55023923444975 130.87081339712915,319.1004784688995 245,321 C 359.12918660287085,322.8995215311005 521.9521531100479,347.1483253588517 616,352 C 710.0478468899521,356.8516746411483 735.3205741626795,342.3062200956938 822,333 C 908.6794258373205,323.6937799043062 1056.7655502392345,319.62679425837325 1170,325 C 1283.2344497607655,330.37320574162675 1361.6172248803828,345.1866028708134 1440,360 C 1440,360 1440,600 1440,600 Z"></path>
            <path id="header-deco-4" d="M 0,600 C 0,600 0,480 0,480 C 70.90909090909093,494.91866028708137 141.81818181818187,509.8373205741627 239,499 C 336.18181818181813,488.1626794258373 459.6363636363636,451.5693779904306 567,446 C 674.3636363636364,440.4306220095694 765.6363636363636,465.88516746411483 862,465 C 958.3636363636364,464.11483253588517 1059.8181818181818,436.8899521531101 1157,435 C 1254.1818181818182,433.1100478468899 1347.090909090909,456.555023923445 1440,480 C 1440,480 1440,600 1440,600 Z"></path>
        </svg>
        <div class="card card-style">
            <div class="content">
                <h4>
                    กรอกรเลขบัตรประชาชน
                </h4>
                <div class="form-custom form-label form-border form-icon mb-3 bg-transparent">
                    <i class="bi bi-person-circle font-13"></i>
                    <input type="text" class="form-control rounded-xs" id="c1" placeholder="โปรดระบุข้อมูล" maxlength="13">
                    <label for="c1" class="color-theme">Username</label>
                    <span>(required)</span>
                </div>

            </div>
        </div>
        <div class="card card-style">
            <div class="content" style="overflow: scroll; padding: 5px;">

                <h4 class="mb-0 mt-2">
                    เงื่อนไขข้อบังคับขั้นต่ำการใช้บริการ NDID
                </h4>
                <p class="mb-0 color-highlight font-12 bottom-10">แก้ไขเมื่อ 01 มกราคม 25666</p>


                <div class="MuiBox-root css-154zku0" id="ndid-terms-box">
                    <ol>
                        <li>
                            <p>ข้อตกลงและเงื่อนไขนี้ (“ข้อตกลง”) ถือเป็นสัญญาให้บริการที่ใช้บังคับกับการใช้บริการและการเข้าร่วมของผู้ใช้บริการในบริการพิสูจน์และยืนยันตัวตนทางดิจิทัลและการทำธุรกรรมอื่น ๆ ที่เกี่ยวเนื่องกับสถาบันคุ้มครองเงินฝากในฐานะที่เป็นผู้ให้บริการ ("สถาบันคุ้มครองเงินฝาก") (ซึ่งต่อไปนี้จะเรียกว่า "บริการพิสูจน์และยืนยันตัวตนทางดิจิทัล" หรือ “NDID Services”) โดยที่การให้บริการพิสูจน์และยืนยันตัวตนทางดิจิทัลของผู้ให้บริการนี้จะดำเนินการผ่านระบบการพิสูจน์และยืนยันตัวตนทางดิจิทัล (“Digital ID Platform”) ที่บริษัท เนชั่นแนลดิจิทัล ไอดี จำกัด ("NDID") เป็นผู้จัดให้มีขึ้น โดยมีนโยบายและเงื่อนไขการใช้ บริการระบบการพิสูจน์และยืนยันตัวตนทางดิจิทัล เป็นไปตามที่ NDID กำหนด ทั้งนี้ ผู้ใช้บริการสามารถศึกษารายละเอียดเพิ่มเติมได้ที่ website:<a href="https://www.ndid.co.th/termandcon.html" target="_blank" rel="noreferrer noopener"> https://www.ndid.co.th/termandcon.html</a></p>
                            <p>ผู้ใช้บริการรับทราบและตกลงว่า การยอมรับข้อตกลงนี้ให้ถือว่าผู้ใช้บริการได้อ่าน เข้าใจ และตกลงที่จะผูกพันตามหลักเกณฑ์ และเงื่อนไขที่กำหนดในข้อตกลงนี้ รวมถึงนโยบายและเงื่อนไขการใช้บริการระบบการพิสูจน์และยืนยันตัวตนทางดิจิทัลของ NDID ทั้งนี้ หากผู้ใช้บริการไม่ยอมรับข้อตกลงดังกล่าวนี้ โปรดอย่าเข้าถึง หรือใช้บริการพิสูจน์และยืนยันตัวตนทางดิจิทัล</p>
                        </li>
                        <li>
                            <p>ผู้ใช้บริการรับทราบว่าก่อนที่ผู้ใช้บริการจะสามารถใช้บริการพิสูจน์และยืนยันตัวตนทางดิจิทัลได้ ผู้ใช้บริการจะต้องลงทะเบียนเพื่อพิสูจน์ตัวตนกับผู้ให้บริการพิสูจน์และยืนยันตัวตนทางดิจิทัลรายอื่น ("Identity Provider" หรือ "IdP") ซึ่งเป็นบุคคลที่ผู้ใช้บริการได้ทำความตกลงที่มีผลทางกฎหมายโดยมีข้อกำหนดในลักษณะเดียวกันกับข้อตกลงนี้</p>
                        </li>
                        <li>
                            <p>เมื่อผู้ใช้บริการขอรับบริการพิสูจน์และยืนยันตัวตนทางดิจิทัลจากผู้ให้บริการแล้ว ผู้ใช้บริการตกลงต่อผู้ให้บริการดังต่อไปนี้</p>
                            <ul>
                                <li>(1) ผู้ให้บริการมีสิทธิใช้ผลการพิสูจน์และยืนยันตัวตนทางดิจิทัลของผู้ใช้บริการที่ Identity Provider อื่น ได้ดำเนินการผ่าน Digital ID Platform</li>
                                <li>(2) ผู้ให้บริการมีสิทธิที่จะรวบรวม ได้รับ ใช้ ประมวลผล และจัดเก็บข้อมูลส่วนบุคคลของผู้ใช้บริการจากผู้ให้ข้อมูลที่น่าเชื่อถือที่เกี่ยวข้อง (authoritative source)</li>
                                <li>(3) เมื่อ Identity Provider ดำเนินการพิสูจน์และยืนยันตัวตนทางดิจิทัลเสร็จสิ้น และผู้ให้ข้อมูลที่น่าเชื่อถือ (authoritative source) ได้รับอนุญาตในการเข้าถึงข้อมูลของผู้ใช้บริการเรียบร้อยแล้ว ผู้ใช้บริการตกลงว่าจะดำเนินการผ่านผู้ให้บริการเพื่ออนุญาตให้ผู้ให้ข้อมูลที่น่าเชื่อถือ (authoritative source) ส่งข้อมูลส่วนบุคคลของผู้ใช้บริการให้กับผู้ให้บริการ ตามรายละเอียดที่ระบุในนโยบายความเป็นส่วนตัวของผู้ให้บริการ (Privacy Policy/Notice) ทั้งนี้ ผู้ใช้บริการรับทราบและตกลงว่า หากผู้ใช้บริการปฏิเสธที่จะดำเนินการดังกล่าวและทำให้ผู้ให้ข้อมูลที่น่าเชื่อถือ (authoritative source) ไม่สามารถส่งข้อมูลส่วนบุคคลของผู้ใช้บริการให้กับผู้ให้บริการได้ ผู้ใช้บริการจะไม่สามารถทำธุรกรรมต่อไปได้ และผู้ให้บริการอาจไม่สามารถที่จะมอบผลิตภัณฑ์หรือบริการตามที่ผู้ใช้บริการต้องการได้</li>
                                <li>(4) ผู้ให้บริการอาจอนุมัติหรือปฏิเสธคำขอของผู้ใช้บริการในการสมัครเข้าใช้บริการพิสูจน์และยืนยันตัวตนทางดิจิทัลของผู้ให้บริการก็ได้ หาก Identity Provider ไม่สามารถพิสูจน์และยืนยันตัวตน หรือผู้ให้ข้อมูลที่น่าเชื่อถือ (authoritative source) ไม่ได้รับอนุญาตให้เข้าถึงข้อมูลหรือไม่สามารถส่งข้อมูลส่วนบุคคลของผู้ใช้บริการตามเงื่อนไข (requirement) ที่กำหนด ทั้งนี้ ไม่ว่าจะด้วยเหตุใดก็ตาม</li>
                                <li>(5) คำขอสมัครใช้บริการพิสูจน์และยืนยันตัวตนทางดิจิทัลของผู้ให้บริการจะมีผลสมบูรณ์เมื่อ Identity Provider ได้พิสูจน์และยืนยันตัวตน และผู้ให้ข้อมูลที่น่าเชื่อถือ (authoritative source) ได้รับอนุญาตให้เข้าถึงข้อมูลและได้ส่งข้อมูลส่วนบุคคลของผู้ใช้บริการแก่ผู้ให้บริการแล้ว</li>
                            </ul>
                        </li>
                        <li>
                            <p>ผู้ใช้บริการรับทราบและตกลงว่า NDID เป็นเพียงผู้ให้บริการระบบ Digital ID Platform ซึ่งเป็นระบบงานสำหรับการส่งต่อข้อมูลและ/หรือจัดเก็บบันทึก Logs ข้อมูลระหว่างสมาชิกของ NDID ตามข้อตกลงและเงื่อนไขของ NDID เท่านั้น โดย NDID จะไม่สามารถเข้าถึงและ/หรือแทรกแซงเนื้อหาของข้อมูลที่มีการแลกเปลี่ยนในระหว่างสมาชิกด้วยกันได้</p>
                            <p>อนึ่ง ผู้ใช้บริการรับทราบและตกลงว่าสมาชิกของ NDID ที่เป็นส่วนหนึ่งของระบบ Digital ID Platform อาจมีการส่งต่อและ/หรือจัดเก็บบันทึก Logs ตามวรรคหนึ่งได้ ทั้งนี้ ข้อมูล Logs ดังกล่าวอาจประกอบไปด้วยข้อมูลที่เกี่ยวข้องกับการทำรายการต่าง ๆ บนระบบ Digital ID Platform แต่จะเป็นข้อมูลที่ไม่สามารถระบุถึงบุคคลที่เป็นเจ้าของข้อมูลได้</p>
                        </li>
                        <li>
                            <p>ผู้ใช้บริการรับทราบและตกลงว่า ความสัมพันธ์ในทางสัญญา (ซึ่งรวมถึงข้อเรียกร้องและความรับผิด) ระหว่างผู้ให้บริการกับผู้ใช้บริการที่เกี่ยวข้องกับผลิตภัณฑ์และบริการของผู้ให้บริการนั้นถือว่าเป็นความผูกพันระหว่างผู้ให้บริการกับผู้ใช้บริการเท่านั้น โดยผู้ให้บริการจะเป็นผู้รับผิดชอบโดยตรงต่อผู้ใช้บริการสำหรับผลิตภัณฑ์และบริการใดก็ตามที่มีการนำเสนอ ให้บริการ หรือขายบริการแก่ผู้ใช้บริการ โดยที่ NDID จะไม่รับผิดชอบต่อผลิตภัณฑ์และบริการของผู้ให้บริการ</p>
                            <p>นอกจากนี้ ผู้ใช้บริการรับทราบและตกลงว่า NDID ตลอดจนบรรดากรรมการ ผู้ถือหุ้น พนักงาน หรือตัวแทนของ NDID จะไม่รับผิดต่อความสูญเสียหรือความเสียหายใด ๆ ไม่ว่าจะเป็นค่าเสียหายโดยตรง ค่าเสียหายโดยอ้อม ค่าเสียหายอันเป็นผลสืบเนื่อง ค่าเสียหายเชิงห้ามปราม ค่าเสียหายเชิงลงโทษ หรือค่าเสียหายอื่นใด ซึ่งรวมถึงการสูญเสียผลกำไรและการสูญเสียค่าความนิยม (goodwill) ซึ่งเกิดขึ้นกับผู้ใช้บริการ และ /หรือบุคคลอื่นใด อันเป็นผลมาจากหรือเกิดจากการให้บริการของ NDID</p>
                        </li>
                        <li>
                            <p>ผู้ใช้บริการตกลงที่จะผูกพันตามบริการพิสูจน์และยืนยันตัวตนทางดิจิทัล และ/หรือธุรกรรมใด ๆ ที่ได้ดำเนินการหรือเข้าทำผ่าน Digital ID Platform</p>
                        </li>
                        <li>
                            <p>ผู้ใช้บริการรับรองว่าข้อมูลและเอกสารทั้งหมด (รวมทั้งสำเนาของข้อมูลและเอกสารดังกล่าว) ที่มอบให้แก่ผู้ให้บริการ (ถ้ามี) เพื่อเป็นการพิสูจน์และยืนยันตัวตน และ/หรือการอนุญาต (authorization) นั้น เป็นจริง ถูกต้อง ครบถ้วนและเป็นข้อมูลที่เป็นปัจจุบัน และรับรองว่าผู้ใช้บริการมีความสามารถในการใช้บริการพิสูจน์และยืนยันตัวตนทางดิจิทัลได้ ซึ่งรวมถึงมีความสามารถในการทำธุรกรรมต่าง ๆ ไม่ว่าบางส่วนหรือทั้งหมด ที่เกี่ยวข้องกับบริการพิสูจน์และยืนยันตัวตนทางดิจิทัลด้วย</p>
                        </li>
                        <li>
                            <p>ผู้ใช้บริการตกลงว่าจะมอบข้อมูลเพิ่มเติมใด ๆ ก็ตามให้แก่ผู้ให้บริการเมื่อได้รับการร้องขอ และ/หรือจะปรับปรุงข้อมูลดังกล่าวให้เป็นปัจจุบัน พร้อมแจ้งให้ผู้ให้บริการทราบทันทีหากมีการเปลี่ยนแปลงข้อมูลนั้น</p>
                        </li>
                        <li>
                            <p>ผู้ใช้บริการรับทราบและตกลงว่า ผู้ให้บริการอาจเก็บรวบรวมและใช้ข้อมูลที่ผู้ใช้บริการมอบให้แก่ผู้ให้บริการซึ่งรวมถึงข้อมูลส่วนบุคคลของผู้ใช้บริการ เช่น ข้อมูลชีวภาพ (ยกตัวอย่างเช่น ลายพิมพ์นิ้วมือ, การจดจำใบหน้า) เพื่อดำเนินการตามสัญญาระหว่างผู้ให้บริการกับผู้ใช้บริการ และ/หรือ ดำเนินการใด ๆ ภายใต้วัตถุประสงค์ที่มีอยู่ในสัญญาดังกล่าว</p>
                            <p>นอกจากนี้ ผู้ใช้บริการรับทราบและตกลงว่า เพื่อการปฏิบัติตามสัญญาซึ่งผู้ใช้บริการได้เข้าไปเป็นคู่สัญญา ผู้ให้บริการอาจเปิดเผยข้อมูลของผู้ใช้บริการตามวรรคหนึ่งแก่ผู้ให้บริการรายอื่น NDID สมาชิกรายอื่นใดของ NDID และ/หรือบุคคลภายนอกเท่าที่จำเป็น เพื่อประโยชน์ในการรับรองความถูกต้องของข้อมูล การบริการพิสูจน์และยืนยันตัวตนทางดิจิทัล การอนุญาต (authorization) และการทำธุรกรรมอื่น ๆ ที่เกี่ยวเนื่อง</p>
                        </li>
                    </ol>
                </div>
            </div>
        </div>

        <a class="btn btn-full mx-3 gradient-blue shadow-bg shadow-bg-s" onclick="SubmitConditionStep1()">ยอมรับ</a>
        <br/>
        <a class="btn btn-full mx-3 gradient-red shadow-bg shadow-bg-s" onclick="redirectToMain()">ปฏิเสธ</a>
    </div>
</asp:Content>
<asp:Content ID="Content3" ContentPlaceHolderID="ContentFooter" runat="server">
    <script src="<%= ResolveClientUrl("~/scripts/Page/NDID.js") + "?v=" + DateTime.Now.ToString("ddMMyyyyHHmmss") %>"></script>
</asp:Content>