<%@ Page Title="" Language="C#" MasterPageFile="~/MasterPage/Site.Master" AutoEventWireup="true" CodeBehind="Step3_1.aspx.cs"
    Inherits="CustomerHealthCheck.views.LOA.Step3_1" %>

<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="server">
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" runat="server">
    <div class="page-content footer-clear" style="padding: 0px !important;">

        <!-- Page Title-->
        <div class="pt-3">
            <div class="page-title d-flex">
                <div class="align-self-center">
                    <a href="#" onclick="redirectToMain()"
                        class="me-3 ms-0 icon icon-xxs bg-theme rounded-s shadow-m">
                        <i class="bi bi-chevron-left color-theme font-14"></i>
                    </a>
                </div>
                <div class="align-self-center me-auto">
                    <h1 class="color-theme mb-0 font-18">ย้อนกลับ </h1>
                </div>
            </div>

        </div>

        <svg id="header-deco" viewBox="0 0 1440 600" xmlns="http://www.w3.org/2000/svg" class="transition duration-300 ease-in-out delay-150">
            <path id="header-deco-1" d="M 0,600 C 0,600 0,120 0,120 C 92.36363636363635,133.79904306220095 184.7272727272727,147.59808612440193 287,148 C 389.2727272727273,148.40191387559807 501.4545454545455,135.40669856459328 592,129 C 682.5454545454545,122.5933014354067 751.4545454545455,122.77511961722489 848,115 C 944.5454545454545,107.22488038277511 1068.7272727272727,91.49282296650718 1172,91 C 1275.2727272727273,90.50717703349282 1357.6363636363635,105.25358851674642 1440,120 C 1440,120 1440,600 1440,600 Z"></path>
            <path id="header-deco-2" d="M 0,600 C 0,600 0,240 0,240 C 98.97607655502392,258.2105263157895 197.95215311004785,276.4210526315789 278,282 C 358.04784688995215,287.5789473684211 419.16746411483257,280.5263157894737 524,265 C 628.8325358851674,249.4736842105263 777.377990430622,225.47368421052633 888,211 C 998.622009569378,196.52631578947367 1071.3205741626793,191.57894736842107 1157,198 C 1242.6794258373207,204.42105263157893 1341.3397129186603,222.21052631578948 1440,240 C 1440,240 1440,600 1440,600 Z"></path>
            <path id="header-deco-3" d="M 0,600 C 0,600 0,360 0,360 C 65.43540669856458,339.55023923444975 130.87081339712915,319.1004784688995 245,321 C 359.12918660287085,322.8995215311005 521.9521531100479,347.1483253588517 616,352 C 710.0478468899521,356.8516746411483 735.3205741626795,342.3062200956938 822,333 C 908.6794258373205,323.6937799043062 1056.7655502392345,319.62679425837325 1170,325 C 1283.2344497607655,330.37320574162675 1361.6172248803828,345.1866028708134 1440,360 C 1440,360 1440,600 1440,600 Z"></path>
            <path id="header-deco-4" d="M 0,600 C 0,600 0,480 0,480 C 70.90909090909093,494.91866028708137 141.81818181818187,509.8373205741627 239,499 C 336.18181818181813,488.1626794258373 459.6363636363636,451.5693779904306 567,446 C 674.3636363636364,440.4306220095694 765.6363636363636,465.88516746411483 862,465 C 958.3636363636364,464.11483253588517 1059.8181818181818,436.8899521531101 1157,435 C 1254.1818181818182,433.1100478468899 1347.090909090909,456.555023923445 1440,480 C 1440,480 1440,600 1440,600 Z"></path>
        </svg>

        <div class="card card-style px-2 py-2" id="pnlSignUpForm">
            <div class="content">
                <h3 class="mb-0 mt-2 font-22">แบบฟอร์มสอบถามทางการเงิน
                </h3>
                <p>
                    กรุณากรอกข้อมูลของท่านให้ครบถ้วน
                </p>



                <div class="stepwizard">
                    <div class="stepwizard-row setup-panel">
                        <div class="stepwizard-step col-xs-3">
                            <a href="#step-1" type="button" class="btn btn-success btn-circle">1</a>
                            <p style="line-height: 16px;"><small>ยอมรับเงื่อนไข NDID</small></p>
                        </div>
                        <div class="stepwizard-step col-xs-3">
                            <a href="#step-2" type="button" class="btn btn-default btn-circle" disabled="disabled">2</a>
                            <p style="line-height: 16px;"><small>เลือกธนาคาร</small></p>
                        </div>
                        <div class="stepwizard-step col-xs-3">
                            <a href="#step-3" type="button" class="btn btn-default btn-circle" disabled="disabled">3</a>
                            <p style="line-height: 16px;"><small>เข้าสู่แอปธนาคาร</small></p>
                        </div>
                        <div class="stepwizard-step col-xs-3">
                            <a href="#step-4" type="button" class="btn btn-default btn-circle" disabled="disabled">4</a>
                            <p style="line-height: 16px;"><small>กลับสู่ระบบ Line TCG</small></p>
                        </div>
                    </div>
                </div>

                <div class="row disabledPanel" style="margin-top: 20px;">

                    <div class="form-custom form-label no-icon mb-3">
                        <input type="text" class="form-control rounded-xs" id="c1" required="" style="text-align: center; color:dimgrey" value="1100xxxxx9999">
                    </div>

                </div>



                <div class="row" style="padding-left: 15px; padding-right: 15px;">

                    <div class="col-12">
                        <div class="content m-0">
                            <div class="row" style="border: 1px solid silver; padding: 10px; margin-top: 20px; border-radius: 10px; height: 250px; overflow-x: scroll; margin-bottom: 20px;">

                                <h2 class="">เงื่อนไขข้อบังคับขั้นต่ำการใช้บริการ NDID</h2>
                                <p>
                                    1. ข้อตกลงและเงื่อนไขนี้ (“ข้อตกลง”) ถือเป็นสัญญาให้บริการที่ใช้บังคับกับการใช้บริการและการเข้าร่วมของผู้เสียภาษีในบริการพิสูจน์และยืนยันตัวตนทางดิจิทัลและการทำธุรกรรมอื่น ๆ ที่เกี่ยวเนื่องกับบสย.ในฐานะที่เป็นผู้ให้บริการ ("บสย.") (ซึ่งต่อไปนี้จะเรียกว่า "บริการพิสูจน์และยืนยันตัวตนทางดิจิทัล" หรือ “NDID Services”) โดยที่การให้บริการพิสูจน์และยืนยันตัวตนทางดิจิทัลของบสย.นี้จะดำเนินการผ่านระบบการพิสูจน์และยืนยันตัวตนทางดิจิทัล (“Digital ID Platform”) ที่บริษัท เนชั่นแนลดิจิทัล ไอดี จำกัด ("NDID") เป็นผู้จัดให้มีขึ้น โดยมีนโยบายและเงื่อนไขการใช้ บริการระบบการพิสูจน์และยืนยันตัวตนทางดิจิทัล เป็นไปตามที่ NDID กำหนด ทั้งนี้ ผู้เสียภาษีสามารถศึกษารายละเอียดเพิ่มเติมที่ได้ website: https://www.ndid.co.th/termandcon.html

ผู้เสียภาษีรับทราบและตกลงว่า การยอมรับข้อตกลงนี้ให้ถือว่าผู้เสียภาษีได้อ่าน เข้าใจ และตกลงที่จะผูกพันตามหลักเกณฑ์ และเงื่อนไขที่กำหนดในข้อตกลงนี้ รวมถึงนโยบายและเงื่อนไขการใช้บริการระบบการพิสูจน์และยืนยันตัวตนทางดิจิทัลของ NDID ทั้งนี้ หากผู้เสียภาษีไม่ยอมรับข้อตกลงดังกล่าวนี้ โปรดอย่าเข้าถึง หรือใช้บริการพิสูจน์และยืนยันตัวตนทางดิจิทัล
                                </p>
                                <p>
                                    2 .ผู้เสียภาษีรับทราบว่าก่อนที่ผู้เสียภาษีจะสามารถใช้บริการพิสูจน์และยืนยันตัวตนทางดิจิทัลได้ ผู้เสียภาษีจะต้องลงทะเบียนเพื่อพิสูจน์ตัวตนกับผู้ให้บริการพิสูจน์และยืนยันตัวตนทางดิจิทัลรายอื่น ("Identity Provider" หรือ "IdP") ซึ่งเป็นบุคคลที่ผู้เสียภาษีได้ทำความตกลงที่มีผลทางกฎหมายโดยมีข้อกำหนดในลักษณะเดียวกันกับข้อตกลงนี้
                                </p>
                                <p>
                                    3. เมื่อผู้เสียภาษีขอรับบริการพิสูจน์และยืนยันตัวตนทางดิจิทัลจากบสย.แล้ว ผู้เสียภาษีตกลงต่อบสย.ดังต่อไปนี้

(1) บสย.มีสิทธิใช้ผลการพิสูจน์และยืนยันตัวตนทางดิจิทัลของผู้เสียภาษีที่ Identity Provider อื่น ได้ดำเนินการผ่าน Digital ID Platform
(2) บสย.มีสิทธิที่จะรวบรวม ได้รับ ใช้ ประมวลผล และจัดเก็บข้อมูลส่วนบุคคลของผู้เสียภาษีจากผู้ให้ข้อมูลที่น่าเชื่อถือที่เกี่ยวข้อง (authoritative source)
(3) เมื่อ Identity Provider ดำเนินการพิสูจน์และยืนยันตัวตนทางดิจิทัลเสร็จสิ้น และผู้ให้ข้อมูลที่น่าเชื่อถือ (authoritative source) ได้รับอนุญาตในการเข้าถึงข้อมูลของผู้เสียภาษีเรียบร้อยแล้ว ผู้เสียภาษีตกลงว่าจะดำเนินการผ่านบสย.เพื่ออนุญาตให้ผู้ให้ข้อมูลที่น่าเชื่อถือ (authoritative source) ส่งข้อมูลส่วนบุคคลของผู้เสียภาษีให้กับบสย. ตามรายละเอียดที่ระบุในนโยบายความเป็นส่วนตัวของผู้ให้บริการ (Privacy Policy/Notice) ทั้งนี้ ผู้เสียภาษีรับทราบและตกลงว่า หากผู้เสียภาษีปฏิเสธที่จะดำเนินการดังกล่าวและทำให้ผู้ให้ข้อมูลที่น่าเชื่อถือ (authoritative source) ไม่สามารถส่งข้อมูลส่วนบุคคลของผู้เสียภาษีให้กับบสย.ได้ ผู้เสียภาษีจะไม่สามารถทำธุรกรรมต่อไปได้ และบสย.อาจไม่สามารถที่จะมอบผลิตภัณฑ์หรือบริการตามที่ผู้เสียภาษีต้องการได้
(4) บสย.อาจอนุมัติหรือปฏิเสธคำขอของผู้เสียภาษีในการสมัครเข้าใช้บริการพิสูจน์และยืนยันตัวตนทางดิจิทัลของบสย.ก็ได้ หาก Identity Provider ไม่สามารถพิสูจน์และยืนยันตัวตน หรือผู้ให้ข้อมูลที่น่าเชื่อถือ (authoritative source) ไม่ได้รับอนุญาตให้เข้าถึงข้อมูลหรือไม่สามารถส่งข้อมูลส่วนบุคคลของผู้เสียภาษีตามเงื่อนไข (requirement) ที่กำหนด ทั้งนี้ ไม่ว่าจะด้วยเหตุใดก็ตาม
(5) คำขอสมัครใช้บริการพิสูจน์และยืนยันตัวตนทางดิจิทัลของบสย.จะมีผลสมบูรณ์เมื่อ Identity Provider ได้พิสูจน์และยืนยันตัวตน และผู้ให้ข้อมูลที่น่าเชื่อถือ (authoritative source) ได้รับอนุญาตให้เข้าถึงข้อมูลและได้ส่งข้อมูลส่วนบุคคลของผู้เสียภาษีแก่บสย.แล้ว
                                </p>
                                <p>
                                    4. ผู้เสียภาษีรับทราบและตกลงว่า NDID เป็นเพียงผู้ให้บริการระบบ Digital ID Platform ซึ่งเป็นระบบงานสำหรับการส่งต่อข้อมูลและ/หรือจัดเก็บบันทึก Logs ข้อมูลระหว่างสมาชิกของ NDID ตามข้อตกลงและเงื่อนไขของ NDID เท่านั้น โดย NDID จะไม่สามารถเข้าถึงและ/หรือแทรกแซงเนื้อหาของข้อมูลที่มีการแลกเปลี่ยนในระหว่างสมาชิกด้วยกันได้

อนึ่ง ผู้เสียภาษีรับทราบและตกลงว่าสมาชิกของ NDID ที่เป็นส่วนหนึ่งของระบบ Digital ID Platform อาจมีการส่งต่อและ/หรือจัดเก็บบันทึก Logs ตามวรรคหนึ่งได้ ทั้งนี้ ข้อมูล Logs ดังกล่าวอาจประกอบไปด้วยข้อมูลที่เกี่ยวข้องกับการทำรายการต่าง ๆ บนระบบ Digital ID Platform แต่จะเป็นข้อมูลที่ไม่สามารถระบุถึงบุคคลที่เป็นเจ้าของข้อมูลได้

                                </p>
                                <p>
                                    5. ผู้เสียภาษีตกลงที่จะผูกพันตามบริการพิสูจน์และยืนยันตัวตนทางดิจิทัล และ/หรือธุรกรรมใด ๆ ที่ได้ดำเนินการหรือเข้าทำผ่าน Digital ID Platform
                                </p>
                                <p>
                                    6. ผู้เสียภาษีรับรองว่าข้อมูลและเอกสารทั้งหมด (รวมทั้งสำเนาของข้อมูลและเอกสารดังกล่าว) ที่มอบให้แก่บสย. (ถ้ามี) เพื่อเป็นการพิสูจน์และยืนยันตัวตน และ/หรือการอนุญาต (authorization) นั้น เป็นจริง ถูกต้อง ครบถ้วนและเป็นข้อมูลที่เป็นปัจจุบัน และรับรองว่าผู้เสียภาษีมีความสามารถในการใช้บริการพิสูจน์และยืนยันตัวตนทางดิจิทัลได้ ซึ่งรวมถึงมีความสามารถในการทำธุรกรรมต่าง ๆ ไม่ว่าบางส่วนหรือทั้งหมด ที่เกี่ยวข้องกับบริการพิสูจน์และยืนยันตัวตนทางดิจิทัลด้วย
                                </p>
                                <p>
                                    7.ผู้เสียภาษีตกลงว่าจะมอบข้อมูลเพิ่มเติมใด ๆ ก็ตามให้แก่บสย.เมื่อได้รับการร้องขอ และ/หรือจะปรับปรุงข้อมูลดังกล่าวให้เป็นปัจจุบัน พร้อมแจ้งให้บสย.ทราบทันทีหากมีการเปลี่ยนแปลงข้อมูลนั้น
                                </p>
                                <p>
                                    8. ผู้เสียภาษีรับทราบและตกลงว่า บสย.อาจเก็บรวบรวมและใช้ข้อมูลที่ผู้เสียภาษีมอบให้แก่บสย.ซึ่งรวมถึงข้อมูลส่วนบุคคลของผู้เสียภาษี เช่น ข้อมูลชีวภาพ (ยกตัวอย่างเช่น ลายพิมพ์นิ้วมือ, การจดจำใบหน้า) เพื่อดำเนินการตามสัญญาระหว่างบสย.กับผู้เสียภาษี และ/หรือ ดำเนินการใด ๆ ภายใต้วัตถุประสงค์ที่มีอยู่ในสัญญาดังกล่าว

นอกจากนี้ ผู้เสียภาษีรับทราบและตกลงว่า เพื่อการปฏิบัติตามสัญญาซึ่งผู้เสียภาษีได้เข้าไปเป็นคู่สัญญา บสย.อาจเปิดเผยข้อมูลของผู้เสียภาษีตามวรรคหนึ่งแก่ผู้ให้บริการรายอื่น NDID สมาชิกรายอื่นใดของ NDID และ/หรือบุคคลภายนอกเท่าที่จำเป็น เพื่อประโยชน์ในการรับรองความถูกต้องของข้อมูล การบริการพิสูจน์และยืนยันตัวตนทางดิจิทัล การอนุญาต (authorization) และการทำธุรกรรมอื่น ๆ ที่เกี่ยวเนื่อง

                                </p>
                                <p>
                                    9. เมื่อผู้เสียภาษีได้ยืนยันตัวตนทางดิจิทัลผ่าน NDID Platform เพื่อเข้าใช้บริการอิเล็กทรอนิกส์ของบสย.แล้ว ตกลงที่จะผูกพันและปฏิบัติ ตามเงื่อนไขดังต่อไปนี้

9.1 การยื่นแบบแสดงรายการและชำระภาษี
(1) เมื่อผู้เสียภาษียื่นรายการข้อมูลตามแบบแสดงรายการ และชำระภาษีผ่านระบบอิเล็กทรอนิกส์ เมื่อผู้เสียภาษีได้ยืนยันการส่งข้อมูล และบสย.ตอบรับการยื่นรายการข้อมูลตามแบบแสดงรายการและรับชำระภาษีแล้ว ถือว่าเป็นการทำรายการโดยผู้เสียภาษี และยอมรับที่จะผูกพันในรายการนั้นว่าเป็นการยื่นแบบแสดงรายการและชำระภาษีของผู้เสียภาษี และรับรองว่ารายการข้อมูลดังกล่าวถูกต้องเป็นจริงทุกประการ รวมถึงจะผูกพันแบบแสดงรายการภาษีที่จัดพิมพ์ขึ้นโดยระบบคอมพิวเตอร์ในรายการข้อมูลตามการยื่นแบบแสดงรายการและชำระภาษีผ่านระบบอิเล็กทรอนิกส์
(2) ผู้เสียภาษีจะต้องชำระภาษีภายในกำหนดเวลาตามกฎหมาย โดยจะต้องชำระภาษีผ่านหน่วยรับชำระภาษีและช่องทางการชำระภาษีที่บสย.กำหนด หากยื่นรายการข้อมูลตามแบบแสดงรายการและชำระภาษีเกินกำหนดเวลาดังกล่าวผู้เสียภาษียอมรับว่าเป็นการยื่นแบบแสดงรายการและชำระภาษีในวันถัดไป
(3) จำนวนเงินที่ผู้เสียภาษีชำระภาษีโดยการโอนเข้าบัญชีเงินฝากธนาคารของบสย.จะต้องมีจำนวนเท่ากับจำนวนภาษีที่ต้องชำระตามแบบแสดงรายการภาษี
(4) กรณีที่ธนาคารแจ้งว่าจำนวนเงินในบัญชีเงินฝากของผู้เสียภาษีมีไม่เพียงพอสำหรับการชำระภาษีตามแบบแสดงรายการภาษี หรือผู้เสียภาษีมิได้ชำระภาษีตามแบบแสดงรายการ จะถือว่าไม่มีการยื่นแบบแสดงรายการและชำระภาษีในครั้งนั้น
(5) กรณีที่เกิดเหตุขัดข้องเป็นเหตุให้มีการหยุดการรับแบบแสดงรายการและรับชำระภาษีเป็นการชั่วคราวหรือกรณีอื่นใด ที่ทำให้ผู้เสียภาษีไม่สามารถยื่นรายการข้อมูลตามแบบแสดงรายการและชำระภาษีผ่านเครือข่ายอินเทอร์เน็ตได้ ผู้เสียภาษียังคงมีหน้าที่ต้องไปยื่นแบบแสดงรายการและชำระภาษี ณ สำนักงานสรรพากรพื้นที่สาขา
9.2 บริการอิเล็กทรอนิกส์อื่น ๆ ของบสย.
การใช้บริการอิเล็กทรอนิกส์อื่น ๆ ของบสย.เป็นไปตามหลักเกณฑ์และเงื่อนไขที่ระบบให้บริการนั้น ๆ กำหนด


                                </p>
                            </div>


                            <div class="row">
                                <div class="col-6">
                                    <a href="#"
                                        onclick="redirectToLOAStep7_2()"
                                        class="btn btn-full mx-1 gradient-red shadow-bg shadow-bg-xs ">ย้อนกลับ</a>
                                </div>

                                <div class="col-6">
                                    <a href="#"
                                        id="btnSubmit"
                                        onclick="redirectToLOAStep3_3()"
                                        class="btn btn-full mx-1 gradient-blue shadow-bg shadow-bg-xs">ถัดไป </a>


                                </div>
                            </div>

                        </div>
                    </div>
                </div>
            </div>
        </div>








    </div>
</asp:Content>
<asp:Content ID="Content3" ContentPlaceHolderID="ContentFooter" runat="server">
    <script src="<%= ResolveClientUrl("~/scripts/Page/LOA/Step3.js") + "?v=" + DateTime.Now.ToString("ddMMyyyyHHmmss") %>"></script>
    <script src="https://code.jquery.com/jquery-3.4.1.min.js"></script>
    <script src="https://stackpath.bootstrapcdn.com/bootstrap/4.3.1/js/bootstrap.min.js"></script>
    <link rel="stylesheet" type="text/css" href="<%= ResolveClientUrl("~/styles/jquery-ui-1.8.10.custom.css") + "?v=" + DateTime.Now.ToString("ddMMyyyyHHmmss") %>">

    <style>
        .stepwizard-step p {
            margin-top: 0px;
            color: #666;
        }

        .stepwizard-row {
            display: table-row;
        }

        .stepwizard {
            display: table;
            width: 100%;
            position: relative;
        }

        .stepwizard-step button[disabled] {
            /*opacity: 1 !important;
    filter: alpha(opacity=100) !important;*/
            background: white;
        }

        .stepwizard .btn.disabled, .stepwizard .btn[disabled], .stepwizard fieldset[disabled] .btn {
            opacity: 1 !important;
            color: #bbb;
            background: white;
            z-index: 9;
        }

        .stepwizard-row:before {
            top: 14px;
            bottom: 0;
            position: absolute;
            content: " ";
            width: 80%;
            height: 1px;
            background-color: #ccc;
            z-index: 0;
            margin-left: 45px;
        }

        .stepwizard-step {
            display: table-cell;
            text-align: center;
            position: relative;
        }

        .btn-circle {
            width: 30px;
            height: 30px;
            text-align: center;
            padding: 6px 0;
            font-size: 12px;
            line-height: 1.428571429;
            border-radius: 15px;
        }
    </style>

    <script>// ------------step-wizard-------------
        $(document).ready(function () {

            var navListItems = $('div.setup-panel div a'),
                allWells = $('.setup-content'),
                allNextBtn = $('.nextBtn');

            allWells.hide();

            navListItems.click(function (e) {
                e.preventDefault();
                var $target = $($(this).attr('href')),
                    $item = $(this);

                if (!$item.hasClass('disabled')) {
                    navListItems.removeClass('btn-success').addClass('btn-default');
                    $item.addClass('btn-success');
                    allWells.hide();
                    $target.show();
                    $target.find('input:eq(0)').focus();
                }
            });

            allNextBtn.click(function () {
                var curStep = $(this).closest(".setup-content"),
                    curStepBtn = curStep.attr("id"),
                    nextStepWizard = $('div.setup-panel div a[href="#' + curStepBtn + '"]').parent().next().children("a"),
                    curInputs = curStep.find("input[type='text'],input[type='url']"),
                    isValid = true;

                $(".form-group").removeClass("has-error");
                for (var i = 0; i < curInputs.length; i++) {
                    if (!curInputs[i].validity.valid) {
                        isValid = false;
                        $(curInputs[i]).closest(".form-group").addClass("has-error");
                    }
                }

                if (isValid) nextStepWizard.removeAttr('disabled').trigger('click');
            });

            $('div.setup-panel div a.btn-success').trigger('click');
        });
    </script>

</asp:Content>
